---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFewPoints
source: html/dca3c6fc-3e3b-3edb-86a4-c802b9ef0199.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFewPoints Property

The toposolid must have at least three distinct points

## Syntax (C#)
```csharp
public static FailureDefinitionId TooFewPoints { get; }
```